; domain
(define (domain dron-strips)

    (:requirements :strips :typing)

    (:types 
        dron transportador caja persona localizacion contenido num
    )

    (:predicates
        (transportador-en ?t - transportador ?l - localizacion)
        (persona-en ?p - persona ?l - localizacion)
        (caja-en ?c - caja ?l - localizacion)
        (caja-en-dron ?c - caja ?d - dron)
        (dron-en ?d - dron ?l - localizacion)

        (persona-necesita ?p - persona ?ctn - contenido)
        (persona-tiene ?p - persona ?ctn - contenido)

        (caja-contiene ?c - caja ?ctn - contenido)
        (caja-disponible ?c - caja)

        (transportador-contiene ?t - transportador ?c - caja)
        (limite-de ?t - transportador ?n - num)
        (siguiente ?n1 - num ?n2 - num)

        (dron-tiene ?d - dron ?c - caja)
        (dron-libre ?d - dron)
    )

    (:action mover_dron
        :parameters (
            ?d - dron
            ?from - localizacion
            ?to - localizacion
        )
        :precondition (and 
            (dron-en ?d ?from)
        )
        :effect (and 
            (not (dron-en ?d ?from))
            (dron-en ?d ?to)
        )
    )

    (:action coger-caja
        :parameters (
            ?d - dron
            ?c - caja
            ?l - localizacion        
        )
        :precondition (and 
            (caja-en ?c ?l)
            (dron-en ?d ?l)
            (caja-disponible ?c)
            (dron-libre ?d)
        )
        :effect (and 
            (not (dron-libre ?d))
            (not (caja-en ?c ?l))
            (caja-en-dron ?c ?d)
            (dron-tiene ?d ?c)
        )
    )

    (:action dejar-caja
        :parameters (
            ?c - caja
            ?d - dron
            ?l - localizacion
        )
        :precondition (and 
            (dron-en ?d ?l)
            (dron-tiene ?d ?c)
            (caja-en-dron ?c ?d)
        )
        :effect (and 
            (not (dron-tiene ?d ?c))
            (not (caja-en-dron ?c ?d))
            (caja-en ?c ?l)
            (dron-libre ?d)
        )
    )

    (:action entregar-caja
        :parameters (
            ?c - caja
            ?d - dron
            ?l - localizacion
            ?ctn - contenido
            ?p - persona
        )
        :precondition (and 
            (dron-en ?d ?l)
            (dron-tiene ?d ?c)
            (persona-en ?p ?l)
            (caja-disponible ?c)
            (caja-en-dron ?c ?d)
            (caja-contiene ?c ?ctn)
        )
        :effect (and 
            (not (caja-en-dron ?c ?d))
            (not (dron-tiene ?d ?c))
            (not (persona-necesita ?p ?ctn))
            (persona-tiene ?p ?ctn)
            (dron-libre ?d)
        )
    )

    (:action poner-caja-en-transportador
        :parameters (
            ?c - caja
            ?d - dron
            ?t - transportador
            ?l - localizacion
            ?nant - num
            ?nsig - num
        )
        :precondition (and 
            (dron-en ?d ?l)
            (transportador-en ?t ?l)
            (caja-en-dron ?c ?d)
            (caja-disponible ?c)
            (limite-de ?t ?nant)
            (siguiente ?nant ?nsig)
        )
        :effect (and 
            (not (caja-en-dron ?c ?d))
            (not (dron-tiene ?d ?c))
            (not (limite-de ?t ?nant))
            (transportador-contiene ?t ?c)
            (limite-de ?t ?nsig)
            (dron-libre ?d)
        )
    )

    (:action coger-caja-de-transportador
        :parameters (
            ?c - caja
            ?d - dron
            ?t - transportador
            ?l - localizacion
            ?nant - num
            ?nact - num
        )
        :precondition (and 
            (dron-en ?d ?l)
            (transportador-en ?t ?l)
            (transportador-contiene ?t ?c)
            (dron-libre ?d)
            (caja-disponible ?c)
            (limite-de ?t ?nact)
        )
        :effect (and 
            (not (dron-libre ?d))
            (not (limite-de ?t ?nact))
            (not (transportador-contiene ?t ?c))
            (dron-tiene ?d ?c)
            (caja-en-dron ?c ?d)
            (limite-de ?t ?nant)
        )
    )

    (:action mover-transportador
        :parameters (
            ?t - transportador
            ?d - dron
            ?to - localizacion
            ?from - localizacion
        )
        :precondition (and 
            (dron-en ?d ?from)
            (transportador-en ?t ?from)
            (dron-libre ?d)
        )
        :effect (and 
            (not (transportador-en ?t ?from))
            (not (dron-en ?d ?from))
            (transportador-en ?t ?to)
            (dron-en ?d ?to)
        )
    )
)

; problem
(define (problem drone_problem_d1_r1_l2_p2_c2_g2_ct2)
(:domain dron-strips)
(:objects
	dron1 - dron
	deposito - localizacion
	loc1 - localizacion
	loc2 - localizacion
	caja1 - caja
	caja2 - caja
	comida - contenido
	medicina - contenido
	persona1 - persona
	persona2 - persona
	transportador1 - transportador
	n0 - num
	n1 - num
	n2 - num
	n3 - num
	n4 - num
)
(:init
	(dron-en dron1 deposito)
	(caja-en caja1 deposito)
	(caja-en caja2 deposito)
	(caja-disponible caja1 )
	(caja-disponible caja2 )
	(persona-en persona1 loc1)
	(persona-en persona2 loc2)
	(transportador-en transportador1 deposito)

	(caja-contiene caja1 comida)
	(caja-contiene caja2 medicina)

	(persona-necesita persona1 comida)
	(persona-necesita persona2 medicina)

	(siguiente n0 n1)
	(siguiente n1 n2)
	(siguiente n2 n3)
	(siguiente n3 n4)

	(limite-de transportador1 n0)

	(dron-libre dron1)
)
(:goal (and
	(persona-tiene persona1 comida)
	(persona-tiene persona2 medicina)

	(dron-en dron1 deposito)
	))
)

; plan
1. (coger-caja dron1 caja1 deposito)
   deleted: (dron-libre dron1) (caja-en caja1 deposito)
   added: (caja-en-dron caja1 dron1) (dron-tiene dron1 caja1)
   goals met: 1 of 3
2. (mover_dron dron1 deposito loc1)
   deleted: (dron-en dron1 deposito)
   added: (dron-en dron1 loc1)
   goals met: 0 of 3
3. (entregar-caja caja1 dron1 loc1 comida persona1)
   deleted: (caja-en-dron caja1 dron1) (dron-tiene dron1 caja1) (persona-necesita persona1 comida)
   added: (persona-tiene persona1 comida) (dron-libre dron1)
   goals met: 1 of 3
4. (mover_dron dron1 loc1 deposito)
   deleted: (dron-en dron1 loc1)
   added: (dron-en dron1 deposito)
   goals met: 2 of 3
5. (coger-caja dron1 caja2 deposito)
   deleted: (dron-libre dron1) (caja-en caja2 deposito)
   added: (caja-en-dron caja2 dron1) (dron-tiene dron1 caja2)
   goals met: 2 of 3
6. (mover_dron dron1 deposito loc2)
   deleted: (dron-en dron1 deposito)
   added: (dron-en dron1 loc2)
   goals met: 1 of 3
7. (entregar-caja caja2 dron1 loc2 medicina persona2)
   deleted: (caja-en-dron caja2 dron1) (dron-tiene dron1 caja2) (persona-necesita persona2 medicina)
   added: (persona-tiene persona2 medicina) (dron-libre dron1)
   goals met: 2 of 3
8. (mover_dron dron1 loc2 deposito)
   deleted: (dron-en dron1 loc2)
   added: (dron-en dron1 deposito)
   goals met: 3 of 3
